[
    {
        "id": 1,
        "titulo": "Site Barbearia Generic",
        "texto": "> Fonte: <https://github.com/DGusFr/barbershop_website> \n\n ### Sobre o Projeto \n\n Eu tenho um grande apelo emocional a este projeto pois ele foi o meu primeiro projeto usando HTML.  \n\n Hoje quando olho para ele ainda sinto a mesma satisfação que senti quando olhei para ele pela primeira vez, mesmo ele sendo um projeto simples, eu consegui colocar em pratica vários conhecimentos sobre TAG e semântica do HTML  \n\n ### Como funciona o projeto? \n\n É um projeto bem simples mas que funciona, basta baixar os arquivos e você já pode ver a magica antecer, é possivel navegar entres diferentes abas. Eu recomendo baixar a extensão LiveServer no VSCode para conseguir ver o projeto como uma aplicação web em funcionamento. \n\n ![Site-barber](/assets/posts/1/barber-01.png) \n\n E como havia dito é possivel acessar outras páginas como HOME, PRODUTOS e CONTATO \n\n Exemplo da página Contatos: \n\n  ![Site-barber](/assets/posts/1/barber-02.png) \n\n "
    },
    {
        "id": 2,
        "titulo": "Site HZC",
        "texto": "> Fonte: <https://github.com/DGusFr/hzc_project_css> \n\n ### Sobre o Projeto \n\n Este projeto foi de grande importância para eu colocar meus conhecimentos de CSS em pratica, estilização e utilização de fontes  \n\n É um projeto muito bonito, claro que o mérito não é só meu, eu desenvolvi ele junto com a Alura onde eu aprendi muito no início da minha jornada de desenvolvimento Web  \n\n ### Como funciona o projeto? \n\n Este projeto tem como base mostrar os melhores videos da marca HZC. \n\n ![Site-barber](/assets/posts/2/hzc-01.png) \n\n Página de reprodução de video: \n\n  ![Site-barber](/assets/posts/2/hzc-02.png) \n\n "
    },
    {
        "id": 3,
        "titulo": "Robotron",
        "texto": "> Fonte: <https://github.com/DGusFr/project_robotron_js> \n\n ### Sobre o Projeto \n\n Este foi o projeto que marcou minha entrada no mundo JavaScript \n\n É um projeto de um robô de combate, onde você pode customizar as propriedades de combate do seu robô.  \n\n ### Como funciona o projeto? \n\n Este projeto é possivel graças ao JavaScript que permite a adicionar e retirar propriedades quantitativamente, sempre seguindo um valor máximo em cada propriedade. \n\n ![robo](/assets/posts/3/robotron-01.png) \n\n Mudando as propriedades de combate do Robô: \n\n  ![robo](/assets/posts/3/robotron-02.png) \n\n "
    },
    {
        "id": 4,
        "titulo": "Adivinha Número",
        "texto": "> Fonte: <https://github.com/DGusFr/game_guess_number> \n\n ### Sobre o Projeto \n\n Neste projeto eu utilizei plugins nativos do JavaScript para reconhecimento de voz  \n\n ### Como funciona o projeto? \n\n Basta ligar o microfone e dizer o número desejado, o site irá dizer se vc está perto ou não do numero. \n\n ![fala](/assets/posts/4/fala-01.png) \n\n Falando um numero, ele irá dizer se o número secreto é maior ou menor que o falado pelo usuario: \n\n  ![robo](/assets/posts/4/fala-02.png) \n\n Quando acertar o numero: \n\n ![robo](/assets/posts/4/fala-03.png) \n\n"
    },
    {
        "id": 5,
        "titulo": "Jogo da Memória",
        "texto": "> Fonte: <https://github.com/DGusFr/memory_game_js> \n\n ### Sobre o Projeto \n\n Neste projeto eu utilizei os meus conhecimentos de JavaScript e estilização de CSS para criar um jogo da memória totalmente funcional \n\n ### Como funciona o projeto? \n\n Basta entrar no link a seguir e jogar, o JavaScript faz o resto por nós. \n\n Jogo: <https://memory-game-pxxgfjbzj-dgusfr.vercel.app/> \n\n ![jogo](/assets/posts/5/memo-01.png) \n\n O codigo também conta o tempo e tentativas do usuário: \n\n  ![jogo](/assets/posts/5/memo-02.png) \n\n Quando ganhar o jogo: \n\n ![jogo](/assets/posts/5/memo-03.png) \n\n"
    },
    {
        "id": 6,
        "titulo": "Mochila de Viagem",
        "texto": "> Fonte: <https://github.com/DGusFr/mochila_js> \n\n ### Sobre o Projeto \n\n Neste projeto eu utilizei os meus conhecimentos de JavaScript para criar uma mochila de viagem que nada mais é que uma lista de itens para levar para viagem, este codigo leva em consideração a Orientação a Objetos e o conceito de contexto para assim ser possivel adicionar itens, quantidade de itens e o nome desse itens, além é claro de poder retirar os itens que quiser \n\n ### Como funciona o projeto? \n\n é muito simples, basta digitar o nome do item e a sua quantidade, sendo que se você tentar adicionar o mesmo item duas vezes um erro será mostrado. \n\n Jogo: <https://mochila-js.vercel.app/> \n\n ![jogo](/assets/posts/6/moc-01.png) \n\n Você pode adicionar e remover itens: \n\n  ![jogo](/assets/posts/6/moc-02.png) \n\n ![jogo](/assets/posts/6/moc-03.png) \n\n"
    }
]